In [57]:
import pandas as pd
import numpy as np

In [74]:
data1 = { "name":"john", "sex":"male", "age":32 }
data2 = { "name":"wan", "sex":"male", "age":24 }
data3 = { "name":"hoge", "sex":"female", "age":45 }
df = pd.DataFrame([data1, data2, data3])
df

   name     sex  age
0  john    male   32
1   wan    male   24
2  hoge  female   45

In [73]:
df.groupby("sex").describe()["age"]

        count  mean       std   min   25%   50%   75%   max
sex
female    1.0  25.0       NaN  25.0  25.0  25.0  25.0  25.0
male      2.0  23.0  1.414214  22.0  22.5  23.0  23.5  24.0

In [77]:
df["age_group"] = df["age"].apply(lambda x: str(x)[0] + "0s")
df

   name     sex  age age_group
0  john    male   32       30s
1   wan    male   24       20s
2  hoge  female   45       40s

In [81]:
df["description"] = df.apply(lambda row: '{} is {} years old' .format(row["name"], row["age"]), axis=1)
df

   name     sex  age age_group           description
0  john    male   32       30s  john is 32 years old
1   wan    male   24       20s   wan is 24 years old
2  hoge  female   45       40s  hoge is 45 years old

In [83]:
df["adult"] = df["age"].apply(lambda x: x>20)
df

   name     sex  age age_group           description  adult
0  john    male   32       30s  john is 32 years old   True
1   wan    male   24       20s   wan is 24 years old   True
2  hoge  female   45       40s  hoge is 45 years old   True